TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ipc.h
//###########################################################################
//
// FILE:    hw_ipc.h
//
// TITLE:   Definitions for the IPC registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_IPC_H
#define HW_IPC_H

//*************************************************************************************************
//
// The following are defines for the IPC register offsets
//
//*************************************************************************************************
#define IPC_O_COUNTERL   0x0U   // IPCCOUNTERL Register
#define IPC_O_COUNTERH   0x4U   // IPCCOUNTERH Register

#define IPC_O_CPU1TOCPU2INTIPCSET(i)        (0x0U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCSET Register
#define IPC_O_CPU1TOCPU2INTIPCCLR(i)        (0x4U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCCLR Register
#define IPC_O_CPU1TOCPU2INTIPCFLG(i)        (0x8U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCFLG Register
#define IPC_O_CPU1TOCPU2INTIPCSENDCOM(i)    (0x10U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCSENDCOM Register
#define IPC_O_CPU1TOCPU2INTIPCSENDADDR(i)   (0x14U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCSENDADDR Register
#define IPC_O_CPU1TOCPU2INTIPCSENDDATA(i)   (0x18U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCSENDDATA Register
#define IPC_O_CPU2TOCPU1INTREMOTEREPLY(i)   (0x1CU + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTREMOTEREPLY Register
#define IPC_O_CPU1TOCPU3INTIPCSET(i)        (0x2000U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCSET Register
#define IPC_O_CPU1TOCPU3INTIPCCLR(i)        (0x2004U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCCLR Register
#define IPC_O_CPU1TOCPU3INTIPCFLG(i)        (0x2008U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCFLG Register
#define IPC_O_CPU1TOCPU3INTIPCSENDCOM(i)    (0x2010U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCSENDCOM Register
#define IPC_O_CPU1TOCPU3INTIPCSENDADDR(i)   (0x2014U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCSENDADDR Register
#define IPC_O_CPU1TOCPU3INTIPCSENDDATA(i)   (0x2018U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCSENDDATA Register
#define IPC_O_CPU3TOCPU1INTREMOTEREPLY(i)   (0x201CU + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTREMOTEREPLY Register
#define IPC_O_CPU1TOHSMINTIPCSET(i)         (0x6000U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU1TOHSMINTIPCSET Register
#define IPC_O_CPU1TOHSMINTIPCCLR(i)         (0x6004U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU1TOHSMINTIPCCLR Register
#define IPC_O_CPU1TOHSMINTIPCFLG(i)         (0x6008U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU1TOHSMINTIPCFLG Register

#define IPC_O_CPU2TOCPU1INTIPCSTS(i)        (0x0U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCSTS Register
#define IPC_O_CPU1TOCPU2INTIPCACK(i)        (0x4U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCACK Register
#define IPC_O_CPU2TOCPU1INTIPCRECVCOM(i)    (0x10U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCRECVCOM Register
#define IPC_O_CPU2TOCPU1INTIPCRECVADDR(i)   (0x14U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCRECVADDR Register
#define IPC_O_CPU2TOCPU1INTIPCRECVDATA(i)   (0x18U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCRECVDATA Register
#define IPC_O_CPU1TOCPU2INTLOCALREPLY(i)    (0x1CU + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTLOCALREPLY Register
#define IPC_O_CPU3TOCPU1INTIPCSTS(i)        (0x2000U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCSTS Register
#define IPC_O_CPU1TOCPU3INTIPCACK(i)        (0x2004U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCACK Register
#define IPC_O_CPU3TOCPU1INTIPCRECVCOM(i)    (0x2010U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCRECVCOM Register
#define IPC_O_CPU3TOCPU1INTIPCRECVADDR(i)   (0x2014U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCRECVADDR Register
#define IPC_O_CPU3TOCPU1INTIPCRECVDATA(i)   (0x2018U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCRECVDATA Register
#define IPC_O_CPU1TOCPU3INTLOCALREPLY(i)    (0x201CU + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTLOCALREPLY Register

#define IPC_O_CPU2TOCPU1INTIPCSET(i)        (0x0U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCSET Register
#define IPC_O_CPU2TOCPU1INTIPCCLR(i)        (0x4U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCCLR Register
#define IPC_O_CPU2TOCPU1INTIPCFLG(i)        (0x8U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCFLG Register
#define IPC_O_CPU2TOCPU1INTIPCSENDCOM(i)    (0x10U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCSENDCOM Register
#define IPC_O_CPU2TOCPU1INTIPCSENDADDR(i)   (0x14U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCSENDADDR Register
#define IPC_O_CPU2TOCPU1INTIPCSENDDATA(i)   (0x18U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCSENDDATA Register
#define IPC_O_CPU1TOCPU2INTREMOTEREPLY(i)   (0x1CU + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTREMOTEREPLY Register
#define IPC_O_CPU2TOCPU3INTIPCSET(i)        (0x2000U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCSET Register
#define IPC_O_CPU2TOCPU3INTIPCCLR(i)        (0x2004U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCCLR Register
#define IPC_O_CPU2TOCPU3INTIPCFLG(i)        (0x2008U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCFLG Register
#define IPC_O_CPU2TOCPU3INTIPCSENDCOM(i)    (0x2010U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCSENDCOM Register
#define IPC_O_CPU2TOCPU3INTIPCSENDADDR(i)   (0x2014U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCSENDADDR Register
#define IPC_O_CPU2TOCPU3INTIPCSENDDATA(i)   (0x2018U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCSENDDATA Register
#define IPC_O_CPU3TOCPU2INTREMOTEREPLY(i)   (0x201CU + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTREMOTEREPLY Register
#define IPC_O_CPU2TOHSMINTIPCSET(i)         (0x6000U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU2TOHSMINTIPCSET Register
#define IPC_O_CPU2TOHSMINTIPCCLR(i)         (0x6004U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU2TOHSMINTIPCCLR Register
#define IPC_O_CPU2TOHSMINTIPCFLG(i)         (0x6008U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU2TOHSMINTIPCFLG Register

