TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ipc.h
#define IPC_O_CPU1TOCPU2INTIPCSTS(i)        (0x0U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCSTS Register
#define IPC_O_CPU2TOCPU1INTIPCACK(i)        (0x4U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTIPCACK Register
#define IPC_O_CPU1TOCPU2INTIPCRECVCOM(i)    (0x10U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCRECVCOM Register
#define IPC_O_CPU1TOCPU2INTIPCRECVADDR(i)   (0x14U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCRECVADDR Register
#define IPC_O_CPU1TOCPU2INTIPCRECVDATA(i)   (0x18U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU2INTIPCRECVDATA Register
#define IPC_O_CPU2TOCPU1INTLOCALREPLY(i)    (0x1CU + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU2TOCPU1INTLOCALREPLY Register
#define IPC_O_CPU3TOCPU2INTIPCSTS(i)        (0x2000U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCSTS Register
#define IPC_O_CPU2TOCPU3INTIPCACK(i)        (0x2004U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCACK Register
#define IPC_O_CPU3TOCPU2INTIPCRECVCOM(i)    (0x2010U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCRECVCOM Register
#define IPC_O_CPU3TOCPU2INTIPCRECVADDR(i)   (0x2014U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCRECVADDR Register
#define IPC_O_CPU3TOCPU2INTIPCRECVDATA(i)   (0x2018U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCRECVDATA Register
#define IPC_O_CPU2TOCPU3INTLOCALREPLY(i)    (0x201CU + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTLOCALREPLY Register

#define IPC_O_CPU3TOCPU1INTIPCSET(i)        (0x0U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCSET Register
#define IPC_O_CPU3TOCPU1INTIPCCLR(i)        (0x4U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCCLR Register
#define IPC_O_CPU3TOCPU1INTIPCFLG(i)        (0x8U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCFLG Register
#define IPC_O_CPU3TOCPU1INTIPCSENDCOM(i)    (0x10U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCSENDCOM Register
#define IPC_O_CPU3TOCPU1INTIPCSENDADDR(i)   (0x14U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCSENDADDR Register
#define IPC_O_CPU3TOCPU1INTIPCSENDDATA(i)   (0x18U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCSENDDATA Register
#define IPC_O_CPU1TOCPU3INTREMOTEREPLY(i)   (0x1CU + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTREMOTEREPLY Register
#define IPC_O_CPU3TOCPU2INTIPCSET(i)        (0x2000U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCSET Register
#define IPC_O_CPU3TOCPU2INTIPCCLR(i)        (0x2004U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCCLR Register
#define IPC_O_CPU3TOCPU2INTIPCFLG(i)        (0x2008U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCFLG Register
#define IPC_O_CPU3TOCPU2INTIPCSENDCOM(i)    (0x2010U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCSENDCOM Register
#define IPC_O_CPU3TOCPU2INTIPCSENDADDR(i)   (0x2014U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCSENDADDR Register
#define IPC_O_CPU3TOCPU2INTIPCSENDDATA(i)   (0x2018U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCSENDDATA Register
#define IPC_O_CPU2TOCPU3INTREMOTEREPLY(i)   (0x201CU + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTREMOTEREPLY Register
#define IPC_O_CPU3TOHSMINTIPCSET(i)         (0x6000U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU3TOHSMINTIPCSET Register
#define IPC_O_CPU3TOHSMINTIPCCLR(i)         (0x6004U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU3TOHSMINTIPCCLR Register
#define IPC_O_CPU3TOHSMINTIPCFLG(i)         (0x6008U + ((i) * 4096U))   // (0 <= i < 2)
                                                                        // CPU3TOHSMINTIPCFLG Register

#define IPC_O_CPU1TOCPU3INTIPCSTS(i)        (0x0U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCSTS Register
#define IPC_O_CPU3TOCPU1INTIPCACK(i)        (0x4U + ((i) * 2048U))      // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTIPCACK Register
#define IPC_O_CPU1TOCPU3INTIPCRECVCOM(i)    (0x10U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCRECVCOM Register
#define IPC_O_CPU1TOCPU3INTIPCRECVADDR(i)   (0x14U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCRECVADDR Register
#define IPC_O_CPU1TOCPU3INTIPCRECVDATA(i)   (0x18U + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU1TOCPU3INTIPCRECVDATA Register
#define IPC_O_CPU3TOCPU1INTLOCALREPLY(i)    (0x1CU + ((i) * 2048U))     // (0 <= i < 4)
                                                                        // CPU3TOCPU1INTLOCALREPLY Register
#define IPC_O_CPU2TOCPU3INTIPCSTS(i)        (0x2000U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCSTS Register
#define IPC_O_CPU3TOCPU2INTIPCACK(i)        (0x2004U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTIPCACK Register
#define IPC_O_CPU2TOCPU3INTIPCRECVCOM(i)    (0x2010U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCRECVCOM Register
#define IPC_O_CPU2TOCPU3INTIPCRECVADDR(i)   (0x2014U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCRECVADDR Register
#define IPC_O_CPU2TOCPU3INTIPCRECVDATA(i)   (0x2018U + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU2TOCPU3INTIPCRECVDATA Register
#define IPC_O_CPU3TOCPU2INTLOCALREPLY(i)    (0x201CU + ((i) * 2048U))   // (0 <= i < 4)
                                                                        // CPU3TOCPU2INTLOCALREPLY Register



//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1TOCPU2INTIPCSET register
//
//*************************************************************************************************
#define IPC_CPU1TOCPU2INTIPCSET_IPC0    0x1U          // Set Remote IPC0 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC1    0x2U          // Set Remote IPC1 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC2    0x4U          // Set Remote IPC2 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC3    0x8U          // Set Remote IPC3 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC4    0x10U         // Set Remote IPC4 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC5    0x20U         // Set Remote IPC5 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC6    0x40U         // Set Remote IPC6 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC7    0x80U         // Set Remote IPC7 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC8    0x100U        // Set Remote IPC8 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC9    0x200U        // Set Remote IPC9 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC10   0x400U        // Set Remote IPC10 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC11   0x800U        // Set Remote IPC11 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC12   0x1000U       // Set Remote IPC12 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC13   0x2000U       // Set Remote IPC13 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC14   0x4000U       // Set Remote IPC14 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC15   0x8000U       // Set Remote IPC15 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC16   0x10000U      // Set Remote IPC16 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC17   0x20000U      // Set Remote IPC17 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC18   0x40000U      // Set Remote IPC18 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC19   0x80000U      // Set Remote IPC19 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC20   0x100000U     // Set Remote IPC20 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC21   0x200000U     // Set Remote IPC21 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC22   0x400000U     // Set Remote IPC22 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC23   0x800000U     // Set Remote IPC23 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC24   0x1000000U    // Set Remote IPC24 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC25   0x2000000U    // Set Remote IPC25 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC26   0x4000000U    // Set Remote IPC26 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC27   0x8000000U    // Set Remote IPC27 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC28   0x10000000U   // Set Remote IPC28 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC29   0x20000000U   // Set Remote IPC29 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC30   0x40000000U   // Set Remote IPC30 Flag
#define IPC_CPU1TOCPU2INTIPCSET_IPC31   0x80000000U   // Set Remote IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1TOCPU2INTIPCCLR register
//
//*************************************************************************************************
#define IPC_CPU1TOCPU2INTIPCCLR_IPC0    0x1U          // Clear CPU1TOCPU2IPCFLG.IPC0 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC1    0x2U          // Clear CPU1TOCPU2IPCFLG.IPC1 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC2    0x4U          // Clear CPU1TOCPU2IPCFLG.IPC2 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC3    0x8U          // Clear CPU1TOCPU2IPCFLG.IPC3 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC4    0x10U         // Clear CPU1TOCPU2IPCFLG.IPC4 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC5    0x20U         // Clear CPU1TOCPU2IPCFLG.IPC5 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC6    0x40U         // Clear CPU1TOCPU2IPCFLG.IPC6 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC7    0x80U         // Clear CPU1TOCPU2IPCFLG.IPC7 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC8    0x100U        // Clear CPU1TOCPU2IPCFLG.IPC8 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC9    0x200U        // Clear CPU1TOCPU2IPCFLG.IPC9 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC10   0x400U        // Clear CPU1TOCPU2IPCFLG.IPC10 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC11   0x800U        // Clear CPU1TOCPU2IPCFLG.IPC11 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC12   0x1000U       // Clear CPU1TOCPU2IPCFLG.IPC12 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC13   0x2000U       // Clear CPU1TOCPU2IPCFLG.IPC13 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC14   0x4000U       // Clear CPU1TOCPU2IPCFLG.IPC14 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC15   0x8000U       // Clear CPU1TOCPU2IPCFLG.IPC15 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC16   0x10000U      // Clear CPU1TOCPU2IPCFLG.IPC16 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC17   0x20000U      // Clear CPU1TOCPU2IPCFLG.IPC17 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC18   0x40000U      // Clear CPU1TOCPU2IPCFLG.IPC18 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC19   0x80000U      // Clear CPU1TOCPU2IPCFLG.IPC19 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC20   0x100000U     // Clear CPU1TOCPU2IPCFLG.IPC20 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC21   0x200000U     // Clear CPU1TOCPU2IPCFLG.IPC21 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC22   0x400000U     // Clear CPU1TOCPU2IPCFLG.IPC22 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC23   0x800000U     // Clear CPU1TOCPU2IPCFLG.IPC23 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC24   0x1000000U    // Clear CPU1TOCPU2IPCFLG.IPC24 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC25   0x2000000U    // Clear CPU1TOCPU2IPCFLG.IPC25 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC26   0x4000000U    // Clear CPU1TOCPU2IPCFLG.IPC26 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC27   0x8000000U    // Clear CPU1TOCPU2IPCFLG.IPC27 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC28   0x10000000U   // Clear CPU1TOCPU2IPCFLG.IPC28 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC29   0x20000000U   // Clear CPU1TOCPU2IPCFLG.IPC29 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC30   0x40000000U   // Clear CPU1TOCPU2IPCFLG.IPC30 Flag
#define IPC_CPU1TOCPU2INTIPCCLR_IPC31   0x80000000U   // Clear CPU1TOCPU2IPCFLG.IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1TOCPU2INTIPCFLG register
//
//*************************************************************************************************
#define IPC_CPU1TOCPU2INTIPCFLG_IPC0    0x1U          // CPU1 to CPU2 IPC0 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC1    0x2U          // CPU1 to CPU2 IPC1 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC2    0x4U          // CPU1 to CPU2 IPC2 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC3    0x8U          // CPU1 to CPU2 IPC3 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC4    0x10U         // CPU1 to CPU2 IPC4 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC5    0x20U         // CPU1 to CPU2 IPC5 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC6    0x40U         // CPU1 to CPU2 IPC6 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC7    0x80U         // CPU1 to CPU2 IPC7 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC8    0x100U        // CPU1 to CPU2 IPC8 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC9    0x200U        // CPU1 to CPU2 IPC9 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC10   0x400U        // CPU1 to CPU2 IPC10 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC11   0x800U        // CPU1 to CPU2 IPC11 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC12   0x1000U       // CPU1 to CPU2 IPC12 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC13   0x2000U       // CPU1 to CPU2 IPC13 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC14   0x4000U       // CPU1 to CPU2 IPC14 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC15   0x8000U       // CPU1 to CPU2 IPC15 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC16   0x10000U      // CPU1 to CPU2 IPC16 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC17   0x20000U      // CPU1 to CPU2 IPC17 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC18   0x40000U      // CPU1 to CPU2 IPC18 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC19   0x80000U      // CPU1 to CPU2 IPC19 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC20   0x100000U     // CPU1 to CPU2 IPC20 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC21   0x200000U     // CPU1 to CPU2 IPC21 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC22   0x400000U     // CPU1 to CPU2 IPC22 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC23   0x800000U     // CPU1 to CPU2 IPC23 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC24   0x1000000U    // CPU1 to CPU2 IPC24 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC25   0x2000000U    // CPU1 to CPU2 IPC25 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC26   0x4000000U    // CPU1 to CPU2 IPC26 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC27   0x8000000U    // CPU1 to CPU2 IPC27 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC28   0x10000000U   // CPU1 to CPU2 IPC28 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC29   0x20000000U   // CPU1 to CPU2 IPC29 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC30   0x40000000U   // CPU1 to CPU2 IPC30 Flag Status
#define IPC_CPU1TOCPU2INTIPCFLG_IPC31   0x80000000U   // CPU1 to CPU2 IPC31 Flag Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1TOCPU3INTIPCSET register
//
//*************************************************************************************************
#define IPC_CPU1TOCPU3INTIPCSET_IPC0    0x1U          // Set Remote IPC0 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC1    0x2U          // Set Remote IPC1 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC2    0x4U          // Set Remote IPC2 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC3    0x8U          // Set Remote IPC3 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC4    0x10U         // Set Remote IPC4 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC5    0x20U         // Set Remote IPC5 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC6    0x40U         // Set Remote IPC6 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC7    0x80U         // Set Remote IPC7 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC8    0x100U        // Set Remote IPC8 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC9    0x200U        // Set Remote IPC9 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC10   0x400U        // Set Remote IPC10 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC11   0x800U        // Set Remote IPC11 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC12   0x1000U       // Set Remote IPC12 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC13   0x2000U       // Set Remote IPC13 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC14   0x4000U       // Set Remote IPC14 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC15   0x8000U       // Set Remote IPC15 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC16   0x10000U      // Set Remote IPC16 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC17   0x20000U      // Set Remote IPC17 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC18   0x40000U      // Set Remote IPC18 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC19   0x80000U      // Set Remote IPC19 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC20   0x100000U     // Set Remote IPC20 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC21   0x200000U     // Set Remote IPC21 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC22   0x400000U     // Set Remote IPC22 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC23   0x800000U     // Set Remote IPC23 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC24   0x1000000U    // Set Remote IPC24 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC25   0x2000000U    // Set Remote IPC25 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC26   0x4000000U    // Set Remote IPC26 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC27   0x8000000U    // Set Remote IPC27 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC28   0x10000000U   // Set Remote IPC28 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC29   0x20000000U   // Set Remote IPC29 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC30   0x40000000U   // Set Remote IPC30 Flag
#define IPC_CPU1TOCPU3INTIPCSET_IPC31   0x80000000U   // Set Remote IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1TOCPU3INTIPCCLR register
//
//*************************************************************************************************
#define IPC_CPU1TOCPU3INTIPCCLR_IPC0    0x1U          // Clear CPU1TOCPU3IPCFLG.IPC0 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC1    0x2U          // Clear CPU1TOCPU3IPCFLG.IPC1 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC2    0x4U          // Clear CPU1TOCPU3IPCFLG.IPC2 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC3    0x8U          // Clear CPU1TOCPU3IPCFLG.IPC3 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC4    0x10U         // Clear CPU1TOCPU3IPCFLG.IPC4 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC5    0x20U         // Clear CPU1TOCPU3IPCFLG.IPC5 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC6    0x40U         // Clear CPU1TOCPU3IPCFLG.IPC6 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC7    0x80U         // Clear CPU1TOCPU3IPCFLG.IPC7 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC8    0x100U        // Clear CPU1TOCPU3IPCFLG.IPC8 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC9    0x200U        // Clear CPU1TOCPU3IPCFLG.IPC9 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC10   0x400U        // Clear CPU1TOCPU3IPCFLG.IPC10 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC11   0x800U        // Clear CPU1TOCPU3IPCFLG.IPC11 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC12   0x1000U       // Clear CPU1TOCPU3IPCFLG.IPC12 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC13   0x2000U       // Clear CPU1TOCPU3IPCFLG.IPC13 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC14   0x4000U       // Clear CPU1TOCPU3IPCFLG.IPC14 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC15   0x8000U       // Clear CPU1TOCPU3IPCFLG.IPC15 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC16   0x10000U      // Clear CPU1TOCPU3IPCFLG.IPC16 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC17   0x20000U      // Clear CPU1TOCPU3IPCFLG.IPC17 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC18   0x40000U      // Clear CPU1TOCPU3IPCFLG.IPC18 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC19   0x80000U      // Clear CPU1TOCPU3IPCFLG.IPC19 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC20   0x100000U     // Clear CPU1TOCPU3IPCFLG.IPC20 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC21   0x200000U     // Clear CPU1TOCPU3IPCFLG.IPC21 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC22   0x400000U     // Clear CPU1TOCPU3IPCFLG.IPC22 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC23   0x800000U     // Clear CPU1TOCPU3IPCFLG.IPC23 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC24   0x1000000U    // Clear CPU1TOCPU3IPCFLG.IPC24 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC25   0x2000000U    // Clear CPU1TOCPU3IPCFLG.IPC25 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC26   0x4000000U    // Clear CPU1TOCPU3IPCFLG.IPC26 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC27   0x8000000U    // Clear CPU1TOCPU3IPCFLG.IPC27 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC28   0x10000000U   // Clear CPU1TOCPU3IPCFLG.IPC28 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC29   0x20000000U   // Clear CPU1TOCPU3IPCFLG.IPC29 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC30   0x40000000U   // Clear CPU1TOCPU3IPCFLG.IPC30 Flag
#define IPC_CPU1TOCPU3INTIPCCLR_IPC31   0x80000000U   // Clear CPU1TOCPU3IPCFLG.IPC31 Flag

