TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ipc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOHSMINTIPCSET register
//
//*************************************************************************************************
#define IPC_CPU2TOHSMINTIPCSET_IPC0    0x1U          // Set Remote IPC0 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC1    0x2U          // Set Remote IPC1 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC2    0x4U          // Set Remote IPC2 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC3    0x8U          // Set Remote IPC3 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC4    0x10U         // Set Remote IPC4 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC5    0x20U         // Set Remote IPC5 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC6    0x40U         // Set Remote IPC6 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC7    0x80U         // Set Remote IPC7 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC8    0x100U        // Set Remote IPC8 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC9    0x200U        // Set Remote IPC9 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC10   0x400U        // Set Remote IPC10 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC11   0x800U        // Set Remote IPC11 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC12   0x1000U       // Set Remote IPC12 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC13   0x2000U       // Set Remote IPC13 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC14   0x4000U       // Set Remote IPC14 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC15   0x8000U       // Set Remote IPC15 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC16   0x10000U      // Set Remote IPC16 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC17   0x20000U      // Set Remote IPC17 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC18   0x40000U      // Set Remote IPC18 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC19   0x80000U      // Set Remote IPC19 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC20   0x100000U     // Set Remote IPC20 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC21   0x200000U     // Set Remote IPC21 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC22   0x400000U     // Set Remote IPC22 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC23   0x800000U     // Set Remote IPC23 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC24   0x1000000U    // Set Remote IPC24 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC25   0x2000000U    // Set Remote IPC25 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC26   0x4000000U    // Set Remote IPC26 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC27   0x8000000U    // Set Remote IPC27 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC28   0x10000000U   // Set Remote IPC28 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC29   0x20000000U   // Set Remote IPC29 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC30   0x40000000U   // Set Remote IPC30 Flag
#define IPC_CPU2TOHSMINTIPCSET_IPC31   0x80000000U   // Set Remote IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOHSMINTIPCCLR register
//
//*************************************************************************************************
#define IPC_CPU2TOHSMINTIPCCLR_IPC0    0x1U          // Clear CPU2TOHSMIPCFLG.IPC0 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC1    0x2U          // Clear CPU2TOHSMIPCFLG.IPC1 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC2    0x4U          // Clear CPU2TOHSMIPCFLG.IPC2 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC3    0x8U          // Clear CPU2TOHSMIPCFLG.IPC3 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC4    0x10U         // Clear CPU2TOHSMIPCFLG.IPC4 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC5    0x20U         // Clear CPU2TOHSMIPCFLG.IPC5 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC6    0x40U         // Clear CPU2TOHSMIPCFLG.IPC6 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC7    0x80U         // Clear CPU2TOHSMIPCFLG.IPC7 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC8    0x100U        // Clear CPU2TOHSMIPCFLG.IPC8 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC9    0x200U        // Clear CPU2TOHSMIPCFLG.IPC9 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC10   0x400U        // Clear CPU2TOHSMIPCFLG.IPC10 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC11   0x800U        // Clear CPU2TOHSMIPCFLG.IPC11 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC12   0x1000U       // Clear CPU2TOHSMIPCFLG.IPC12 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC13   0x2000U       // Clear CPU2TOHSMIPCFLG.IPC13 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC14   0x4000U       // Clear CPU2TOHSMIPCFLG.IPC14 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC15   0x8000U       // Clear CPU2TOHSMIPCFLG.IPC15 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC16   0x10000U      // Clear CPU2TOHSMIPCFLG.IPC16 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC17   0x20000U      // Clear CPU2TOHSMIPCFLG.IPC17 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC18   0x40000U      // Clear CPU2TOHSMIPCFLG.IPC18 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC19   0x80000U      // Clear CPU2TOHSMIPCFLG.IPC19 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC20   0x100000U     // Clear CPU2TOHSMIPCFLG.IPC20 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC21   0x200000U     // Clear CPU2TOHSMIPCFLG.IPC21 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC22   0x400000U     // Clear CPU2TOHSMIPCFLG.IPC22 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC23   0x800000U     // Clear CPU2TOHSMIPCFLG.IPC23 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC24   0x1000000U    // Clear CPU2TOHSMIPCFLG.IPC24 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC25   0x2000000U    // Clear CPU2TOHSMIPCFLG.IPC25 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC26   0x4000000U    // Clear CPU2TOHSMIPCFLG.IPC26 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC27   0x8000000U    // Clear CPU2TOHSMIPCFLG.IPC27 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC28   0x10000000U   // Clear CPU2TOHSMIPCFLG.IPC28 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC29   0x20000000U   // Clear CPU2TOHSMIPCFLG.IPC29 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC30   0x40000000U   // Clear CPU2TOHSMIPCFLG.IPC30 Flag
#define IPC_CPU2TOHSMINTIPCCLR_IPC31   0x80000000U   // Clear CPU2TOHSMIPCFLG.IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOHSMINTIPCFLG register
//
//*************************************************************************************************
#define IPC_CPU2TOHSMINTIPCFLG_IPC0    0x1U          // HSM to CPU2 IPC0 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC1    0x2U          // HSM to CPU2 IPC1 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC2    0x4U          // HSM to CPU2 IPC2 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC3    0x8U          // HSM to CPU2 IPC3 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC4    0x10U         // HSM to CPU2 IPC4 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC5    0x20U         // HSM to CPU2 IPC5 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC6    0x40U         // HSM to CPU2 IPC6 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC7    0x80U         // HSM to CPU2 IPC7 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC8    0x100U        // HSM to CPU2 IPC8 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC9    0x200U        // HSM to CPU2 IPC9 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC10   0x400U        // HSM to CPU2 IPC10 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC11   0x800U        // HSM to CPU2 IPC11 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC12   0x1000U       // HSM to CPU2 IPC12 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC13   0x2000U       // HSM to CPU2 IPC13 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC14   0x4000U       // HSM to CPU2 IPC14 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC15   0x8000U       // HSM to CPU2 IPC15 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC16   0x10000U      // HSM to CPU2 IPC16 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC17   0x20000U      // HSM to CPU2 IPC17 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC18   0x40000U      // HSM to CPU2 IPC18 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC19   0x80000U      // HSM to CPU2 IPC19 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC20   0x100000U     // HSM to CPU2 IPC20 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC21   0x200000U     // HSM to CPU2 IPC21 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC22   0x400000U     // HSM to CPU2 IPC22 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC23   0x800000U     // HSM to CPU2 IPC23 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC24   0x1000000U    // HSM to CPU2 IPC24 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC25   0x2000000U    // HSM to CPU2 IPC25 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC26   0x4000000U    // HSM to CPU2 IPC26 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC27   0x8000000U    // HSM to CPU2 IPC27 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC28   0x10000000U   // HSM to CPU2 IPC28 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC29   0x20000000U   // HSM to CPU2 IPC29 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC30   0x40000000U   // HSM to CPU2 IPC30 Flag Status
#define IPC_CPU2TOHSMINTIPCFLG_IPC31   0x80000000U   // HSM to CPU2 IPC31 Flag Status


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1TOCPU2INTIPCSTS register
//
//*************************************************************************************************
#define IPC_CPU1TOCPU2INTIPCSTS_IPC0    0x1U          // Local IPC Flag 0 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC1    0x2U          // Local IPC Flag 1 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC2    0x4U          // Local IPC Flag 2 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC3    0x8U          // Local IPC Flag 3 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC4    0x10U         // Local IPC Flag 4 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC5    0x20U         // Local IPC Flag 5 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC6    0x40U         // Local IPC Flag 6 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC7    0x80U         // Local IPC Flag 7 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC8    0x100U        // Local IPC Flag 8 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC9    0x200U        // Local IPC Flag 9 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC10   0x400U        // Local IPC Flag 10 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC11   0x800U        // Local IPC Flag 11 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC12   0x1000U       // Local IPC Flag 12 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC13   0x2000U       // Local IPC Flag 13 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC14   0x4000U       // Local IPC Flag 14 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC15   0x8000U       // Local IPC Flag 15 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC16   0x10000U      // Local IPC Flag 16 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC17   0x20000U      // Local IPC Flag 17 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC18   0x40000U      // Local IPC Flag 18 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC19   0x80000U      // Local IPC Flag 19 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC20   0x100000U     // Local IPC Flag 20 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC21   0x200000U     // Local IPC Flag 21 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC22   0x400000U     // Local IPC Flag 22 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC23   0x800000U     // Local IPC Flag 23 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC24   0x1000000U    // Local IPC Flag 24 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC25   0x2000000U    // Local IPC Flag 25 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC26   0x4000000U    // Local IPC Flag 26 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC27   0x8000000U    // Local IPC Flag 27 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC28   0x10000000U   // Local IPC Flag 28 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC29   0x20000000U   // Local IPC Flag 29 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC30   0x40000000U   // Local IPC Flag 30 Status
#define IPC_CPU1TOCPU2INTIPCSTS_IPC31   0x80000000U   // Local IPC Flag 31 Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOCPU1INTIPCACK register
//
//*************************************************************************************************
#define IPC_CPU2TOCPU1INTIPCACK_IPC0    0x1U          // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC0 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC1    0x2U          // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC1 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC2    0x4U          // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC2 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC3    0x8U          // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC3 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC4    0x10U         // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC4 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC5    0x20U         // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC5 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC6    0x40U         // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC6 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC7    0x80U         // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC7 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC8    0x100U        // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC8 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC9    0x200U        // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC9 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC10   0x400U        // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC10 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC11   0x800U        // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC11 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC12   0x1000U       // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC12 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC13   0x2000U       // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC13 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC14   0x4000U       // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC14 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC15   0x8000U       // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC15 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC16   0x10000U      // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC16 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC17   0x20000U      // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC17 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC18   0x40000U      // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC18 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC19   0x80000U      // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC19 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC20   0x100000U     // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC20 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC21   0x200000U     // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC21 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC22   0x400000U     // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC22 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC23   0x800000U     // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC23 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC24   0x1000000U    // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC24 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC25   0x2000000U    // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC25 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC26   0x4000000U    // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC26 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC27   0x8000000U    // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC27 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC28   0x10000000U   // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC28 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC29   0x20000000U   // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC29 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC30   0x40000000U   // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC30 bit
#define IPC_CPU2TOCPU1INTIPCACK_IPC31   0x80000000U   // Acknowledgement from CPU1 to
                                                      // CPU2TOCPU1IPCFLG.IPC31 bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3TOCPU2INTIPCSTS register
//
//*************************************************************************************************
#define IPC_CPU3TOCPU2INTIPCSTS_IPC0    0x1U          // Local IPC Flag 0 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC1    0x2U          // Local IPC Flag 1 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC2    0x4U          // Local IPC Flag 2 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC3    0x8U          // Local IPC Flag 3 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC4    0x10U         // Local IPC Flag 4 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC5    0x20U         // Local IPC Flag 5 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC6    0x40U         // Local IPC Flag 6 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC7    0x80U         // Local IPC Flag 7 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC8    0x100U        // Local IPC Flag 8 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC9    0x200U        // Local IPC Flag 9 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC10   0x400U        // Local IPC Flag 10 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC11   0x800U        // Local IPC Flag 11 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC12   0x1000U       // Local IPC Flag 12 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC13   0x2000U       // Local IPC Flag 13 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC14   0x4000U       // Local IPC Flag 14 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC15   0x8000U       // Local IPC Flag 15 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC16   0x10000U      // Local IPC Flag 16 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC17   0x20000U      // Local IPC Flag 17 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC18   0x40000U      // Local IPC Flag 18 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC19   0x80000U      // Local IPC Flag 19 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC20   0x100000U     // Local IPC Flag 20 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC21   0x200000U     // Local IPC Flag 21 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC22   0x400000U     // Local IPC Flag 22 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC23   0x800000U     // Local IPC Flag 23 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC24   0x1000000U    // Local IPC Flag 24 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC25   0x2000000U    // Local IPC Flag 25 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC26   0x4000000U    // Local IPC Flag 26 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC27   0x8000000U    // Local IPC Flag 27 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC28   0x10000000U   // Local IPC Flag 28 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC29   0x20000000U   // Local IPC Flag 29 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC30   0x40000000U   // Local IPC Flag 30 Status
#define IPC_CPU3TOCPU2INTIPCSTS_IPC31   0x80000000U   // Local IPC Flag 31 Status

