TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ipc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2TOCPU3INTIPCACK register
//
//*************************************************************************************************
#define IPC_CPU2TOCPU3INTIPCACK_IPC0    0x1U          // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC0 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC1    0x2U          // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC1 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC2    0x4U          // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC2 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC3    0x8U          // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC3 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC4    0x10U         // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC4 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC5    0x20U         // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC5 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC6    0x40U         // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC6 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC7    0x80U         // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC7 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC8    0x100U        // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC8 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC9    0x200U        // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC9 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC10   0x400U        // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC10 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC11   0x800U        // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC11 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC12   0x1000U       // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC12 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC13   0x2000U       // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC13 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC14   0x4000U       // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC14 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC15   0x8000U       // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC15 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC16   0x10000U      // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC16 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC17   0x20000U      // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC17 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC18   0x40000U      // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC18 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC19   0x80000U      // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC19 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC20   0x100000U     // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC20 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC21   0x200000U     // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC21 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC22   0x400000U     // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC22 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC23   0x800000U     // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC23 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC24   0x1000000U    // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC24 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC25   0x2000000U    // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC25 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC26   0x4000000U    // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC26 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC27   0x8000000U    // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC27 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC28   0x10000000U   // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC28 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC29   0x20000000U   // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC29 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC30   0x40000000U   // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC30 bit
#define IPC_CPU2TOCPU3INTIPCACK_IPC31   0x80000000U   // Acknowledgement from CPU3 to
                                                      // CPU2TOCPU3IPCFLG.IPC31 bit


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3TOCPU1INTIPCSET register
//
//*************************************************************************************************
#define IPC_CPU3TOCPU1INTIPCSET_IPC0    0x1U          // Set Remote IPC0 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC1    0x2U          // Set Remote IPC1 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC2    0x4U          // Set Remote IPC2 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC3    0x8U          // Set Remote IPC3 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC4    0x10U         // Set Remote IPC4 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC5    0x20U         // Set Remote IPC5 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC6    0x40U         // Set Remote IPC6 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC7    0x80U         // Set Remote IPC7 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC8    0x100U        // Set Remote IPC8 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC9    0x200U        // Set Remote IPC9 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC10   0x400U        // Set Remote IPC10 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC11   0x800U        // Set Remote IPC11 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC12   0x1000U       // Set Remote IPC12 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC13   0x2000U       // Set Remote IPC13 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC14   0x4000U       // Set Remote IPC14 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC15   0x8000U       // Set Remote IPC15 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC16   0x10000U      // Set Remote IPC16 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC17   0x20000U      // Set Remote IPC17 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC18   0x40000U      // Set Remote IPC18 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC19   0x80000U      // Set Remote IPC19 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC20   0x100000U     // Set Remote IPC20 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC21   0x200000U     // Set Remote IPC21 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC22   0x400000U     // Set Remote IPC22 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC23   0x800000U     // Set Remote IPC23 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC24   0x1000000U    // Set Remote IPC24 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC25   0x2000000U    // Set Remote IPC25 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC26   0x4000000U    // Set Remote IPC26 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC27   0x8000000U    // Set Remote IPC27 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC28   0x10000000U   // Set Remote IPC28 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC29   0x20000000U   // Set Remote IPC29 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC30   0x40000000U   // Set Remote IPC30 Flag
#define IPC_CPU3TOCPU1INTIPCSET_IPC31   0x80000000U   // Set Remote IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3TOCPU1INTIPCCLR register
//
//*************************************************************************************************
#define IPC_CPU3TOCPU1INTIPCCLR_IPC0    0x1U          // Clear CPU3TOCPU1IPCFLG.IPC0 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC1    0x2U          // Clear CPU3TOCPU1IPCFLG.IPC1 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC2    0x4U          // Clear CPU3TOCPU1IPCFLG.IPC2 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC3    0x8U          // Clear CPU3TOCPU1IPCFLG.IPC3 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC4    0x10U         // Clear CPU3TOCPU1IPCFLG.IPC4 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC5    0x20U         // Clear CPU3TOCPU1IPCFLG.IPC5 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC6    0x40U         // Clear CPU3TOCPU1IPCFLG.IPC6 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC7    0x80U         // Clear CPU3TOCPU1IPCFLG.IPC7 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC8    0x100U        // Clear CPU3TOCPU1IPCFLG.IPC8 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC9    0x200U        // Clear CPU3TOCPU1IPCFLG.IPC9 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC10   0x400U        // Clear CPU3TOCPU1IPCFLG.IPC10 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC11   0x800U        // Clear CPU3TOCPU1IPCFLG.IPC11 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC12   0x1000U       // Clear CPU3TOCPU1IPCFLG.IPC12 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC13   0x2000U       // Clear CPU3TOCPU1IPCFLG.IPC13 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC14   0x4000U       // Clear CPU3TOCPU1IPCFLG.IPC14 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC15   0x8000U       // Clear CPU3TOCPU1IPCFLG.IPC15 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC16   0x10000U      // Clear CPU3TOCPU1IPCFLG.IPC16 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC17   0x20000U      // Clear CPU3TOCPU1IPCFLG.IPC17 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC18   0x40000U      // Clear CPU3TOCPU1IPCFLG.IPC18 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC19   0x80000U      // Clear CPU3TOCPU1IPCFLG.IPC19 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC20   0x100000U     // Clear CPU3TOCPU1IPCFLG.IPC20 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC21   0x200000U     // Clear CPU3TOCPU1IPCFLG.IPC21 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC22   0x400000U     // Clear CPU3TOCPU1IPCFLG.IPC22 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC23   0x800000U     // Clear CPU3TOCPU1IPCFLG.IPC23 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC24   0x1000000U    // Clear CPU3TOCPU1IPCFLG.IPC24 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC25   0x2000000U    // Clear CPU3TOCPU1IPCFLG.IPC25 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC26   0x4000000U    // Clear CPU3TOCPU1IPCFLG.IPC26 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC27   0x8000000U    // Clear CPU3TOCPU1IPCFLG.IPC27 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC28   0x10000000U   // Clear CPU3TOCPU1IPCFLG.IPC28 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC29   0x20000000U   // Clear CPU3TOCPU1IPCFLG.IPC29 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC30   0x40000000U   // Clear CPU3TOCPU1IPCFLG.IPC30 Flag
#define IPC_CPU3TOCPU1INTIPCCLR_IPC31   0x80000000U   // Clear CPU3TOCPU1IPCFLG.IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3TOCPU1INTIPCFLG register
//
//*************************************************************************************************
#define IPC_CPU3TOCPU1INTIPCFLG_IPC0    0x1U          // CPU3 to CPU1 IPC0 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC1    0x2U          // CPU3 to CPU1 IPC1 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC2    0x4U          // CPU3 to CPU1 IPC2 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC3    0x8U          // CPU3 to CPU1 IPC3 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC4    0x10U         // CPU3 to CPU1 IPC4 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC5    0x20U         // CPU3 to CPU1 IPC5 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC6    0x40U         // CPU3 to CPU1 IPC6 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC7    0x80U         // CPU3 to CPU1 IPC7 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC8    0x100U        // CPU3 to CPU1 IPC8 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC9    0x200U        // CPU3 to CPU1 IPC9 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC10   0x400U        // CPU3 to CPU1 IPC10 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC11   0x800U        // CPU3 to CPU1 IPC11 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC12   0x1000U       // CPU3 to CPU1 IPC12 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC13   0x2000U       // CPU3 to CPU1 IPC13 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC14   0x4000U       // CPU3 to CPU1 IPC14 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC15   0x8000U       // CPU3 to CPU1 IPC15 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC16   0x10000U      // CPU3 to CPU1 IPC16 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC17   0x20000U      // CPU3 to CPU1 IPC17 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC18   0x40000U      // CPU3 to CPU1 IPC18 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC19   0x80000U      // CPU3 to CPU1 IPC19 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC20   0x100000U     // CPU3 to CPU1 IPC20 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC21   0x200000U     // CPU3 to CPU1 IPC21 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC22   0x400000U     // CPU3 to CPU1 IPC22 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC23   0x800000U     // CPU3 to CPU1 IPC23 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC24   0x1000000U    // CPU3 to CPU1 IPC24 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC25   0x2000000U    // CPU3 to CPU1 IPC25 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC26   0x4000000U    // CPU3 to CPU1 IPC26 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC27   0x8000000U    // CPU3 to CPU1 IPC27 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC28   0x10000000U   // CPU3 to CPU1 IPC28 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC29   0x20000000U   // CPU3 to CPU1 IPC29 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC30   0x40000000U   // CPU3 to CPU1 IPC30 Flag Status
#define IPC_CPU3TOCPU1INTIPCFLG_IPC31   0x80000000U   // CPU3 to CPU1 IPC31 Flag Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3TOCPU2INTIPCSET register
//
//*************************************************************************************************
#define IPC_CPU3TOCPU2INTIPCSET_IPC0    0x1U          // Set Remote IPC0 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC1    0x2U          // Set Remote IPC1 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC2    0x4U          // Set Remote IPC2 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC3    0x8U          // Set Remote IPC3 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC4    0x10U         // Set Remote IPC4 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC5    0x20U         // Set Remote IPC5 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC6    0x40U         // Set Remote IPC6 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC7    0x80U         // Set Remote IPC7 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC8    0x100U        // Set Remote IPC8 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC9    0x200U        // Set Remote IPC9 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC10   0x400U        // Set Remote IPC10 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC11   0x800U        // Set Remote IPC11 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC12   0x1000U       // Set Remote IPC12 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC13   0x2000U       // Set Remote IPC13 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC14   0x4000U       // Set Remote IPC14 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC15   0x8000U       // Set Remote IPC15 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC16   0x10000U      // Set Remote IPC16 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC17   0x20000U      // Set Remote IPC17 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC18   0x40000U      // Set Remote IPC18 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC19   0x80000U      // Set Remote IPC19 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC20   0x100000U     // Set Remote IPC20 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC21   0x200000U     // Set Remote IPC21 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC22   0x400000U     // Set Remote IPC22 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC23   0x800000U     // Set Remote IPC23 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC24   0x1000000U    // Set Remote IPC24 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC25   0x2000000U    // Set Remote IPC25 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC26   0x4000000U    // Set Remote IPC26 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC27   0x8000000U    // Set Remote IPC27 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC28   0x10000000U   // Set Remote IPC28 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC29   0x20000000U   // Set Remote IPC29 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC30   0x40000000U   // Set Remote IPC30 Flag
#define IPC_CPU3TOCPU2INTIPCSET_IPC31   0x80000000U   // Set Remote IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3TOCPU2INTIPCCLR register
//
//*************************************************************************************************
#define IPC_CPU3TOCPU2INTIPCCLR_IPC0    0x1U          // Clear CPU3TOCPU2IPCFLG.IPC0 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC1    0x2U          // Clear CPU3TOCPU2IPCFLG.IPC1 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC2    0x4U          // Clear CPU3TOCPU2IPCFLG.IPC2 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC3    0x8U          // Clear CPU3TOCPU2IPCFLG.IPC3 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC4    0x10U         // Clear CPU3TOCPU2IPCFLG.IPC4 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC5    0x20U         // Clear CPU3TOCPU2IPCFLG.IPC5 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC6    0x40U         // Clear CPU3TOCPU2IPCFLG.IPC6 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC7    0x80U         // Clear CPU3TOCPU2IPCFLG.IPC7 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC8    0x100U        // Clear CPU3TOCPU2IPCFLG.IPC8 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC9    0x200U        // Clear CPU3TOCPU2IPCFLG.IPC9 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC10   0x400U        // Clear CPU3TOCPU2IPCFLG.IPC10 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC11   0x800U        // Clear CPU3TOCPU2IPCFLG.IPC11 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC12   0x1000U       // Clear CPU3TOCPU2IPCFLG.IPC12 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC13   0x2000U       // Clear CPU3TOCPU2IPCFLG.IPC13 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC14   0x4000U       // Clear CPU3TOCPU2IPCFLG.IPC14 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC15   0x8000U       // Clear CPU3TOCPU2IPCFLG.IPC15 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC16   0x10000U      // Clear CPU3TOCPU2IPCFLG.IPC16 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC17   0x20000U      // Clear CPU3TOCPU2IPCFLG.IPC17 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC18   0x40000U      // Clear CPU3TOCPU2IPCFLG.IPC18 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC19   0x80000U      // Clear CPU3TOCPU2IPCFLG.IPC19 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC20   0x100000U     // Clear CPU3TOCPU2IPCFLG.IPC20 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC21   0x200000U     // Clear CPU3TOCPU2IPCFLG.IPC21 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC22   0x400000U     // Clear CPU3TOCPU2IPCFLG.IPC22 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC23   0x800000U     // Clear CPU3TOCPU2IPCFLG.IPC23 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC24   0x1000000U    // Clear CPU3TOCPU2IPCFLG.IPC24 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC25   0x2000000U    // Clear CPU3TOCPU2IPCFLG.IPC25 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC26   0x4000000U    // Clear CPU3TOCPU2IPCFLG.IPC26 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC27   0x8000000U    // Clear CPU3TOCPU2IPCFLG.IPC27 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC28   0x10000000U   // Clear CPU3TOCPU2IPCFLG.IPC28 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC29   0x20000000U   // Clear CPU3TOCPU2IPCFLG.IPC29 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC30   0x40000000U   // Clear CPU3TOCPU2IPCFLG.IPC30 Flag
#define IPC_CPU3TOCPU2INTIPCCLR_IPC31   0x80000000U   // Clear CPU3TOCPU2IPCFLG.IPC31 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3TOCPU2INTIPCFLG register
//
//*************************************************************************************************
#define IPC_CPU3TOCPU2INTIPCFLG_IPC0    0x1U          // CPU3 to CPU2 IPC0 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC1    0x2U          // CPU3 to CPU2 IPC1 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC2    0x4U          // CPU3 to CPU2 IPC2 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC3    0x8U          // CPU3 to CPU2 IPC3 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC4    0x10U         // CPU3 to CPU2 IPC4 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC5    0x20U         // CPU3 to CPU2 IPC5 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC6    0x40U         // CPU3 to CPU2 IPC6 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC7    0x80U         // CPU3 to CPU2 IPC7 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC8    0x100U        // CPU3 to CPU2 IPC8 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC9    0x200U        // CPU3 to CPU2 IPC9 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC10   0x400U        // CPU3 to CPU2 IPC10 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC11   0x800U        // CPU3 to CPU2 IPC11 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC12   0x1000U       // CPU3 to CPU2 IPC12 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC13   0x2000U       // CPU3 to CPU2 IPC13 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC14   0x4000U       // CPU3 to CPU2 IPC14 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC15   0x8000U       // CPU3 to CPU2 IPC15 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC16   0x10000U      // CPU3 to CPU2 IPC16 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC17   0x20000U      // CPU3 to CPU2 IPC17 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC18   0x40000U      // CPU3 to CPU2 IPC18 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC19   0x80000U      // CPU3 to CPU2 IPC19 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC20   0x100000U     // CPU3 to CPU2 IPC20 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC21   0x200000U     // CPU3 to CPU2 IPC21 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC22   0x400000U     // CPU3 to CPU2 IPC22 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC23   0x800000U     // CPU3 to CPU2 IPC23 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC24   0x1000000U    // CPU3 to CPU2 IPC24 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC25   0x2000000U    // CPU3 to CPU2 IPC25 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC26   0x4000000U    // CPU3 to CPU2 IPC26 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC27   0x8000000U    // CPU3 to CPU2 IPC27 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC28   0x10000000U   // CPU3 to CPU2 IPC28 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC29   0x20000000U   // CPU3 to CPU2 IPC29 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC30   0x40000000U   // CPU3 to CPU2 IPC30 Flag Status
#define IPC_CPU3TOCPU2INTIPCFLG_IPC31   0x80000000U   // CPU3 to CPU2 IPC31 Flag Status

