TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ipc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3TOCPU2INTIPCACK register
//
//*************************************************************************************************
#define IPC_CPU3TOCPU2INTIPCACK_IPC0    0x1U          // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC0 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC1    0x2U          // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC1 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC2    0x4U          // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC2 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC3    0x8U          // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC3 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC4    0x10U         // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC4 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC5    0x20U         // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC5 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC6    0x40U         // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC6 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC7    0x80U         // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC7 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC8    0x100U        // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC8 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC9    0x200U        // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC9 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC10   0x400U        // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC10 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC11   0x800U        // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC11 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC12   0x1000U       // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC12 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC13   0x2000U       // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC13 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC14   0x4000U       // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC14 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC15   0x8000U       // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC15 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC16   0x10000U      // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC16 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC17   0x20000U      // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC17 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC18   0x40000U      // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC18 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC19   0x80000U      // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC19 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC20   0x100000U     // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC20 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC21   0x200000U     // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC21 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC22   0x400000U     // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC22 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC23   0x800000U     // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC23 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC24   0x1000000U    // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC24 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC25   0x2000000U    // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC25 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC26   0x4000000U    // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC26 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC27   0x8000000U    // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC27 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC28   0x10000000U   // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC28 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC29   0x20000000U   // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC29 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC30   0x40000000U   // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC30 bit
#define IPC_CPU3TOCPU2INTIPCACK_IPC31   0x80000000U   // Acknowledgement from CPU2 to
                                                      // CPU3TOCPU2IPCFLG.IPC31 bit



#endif
